powenko/STM32L152C-Discovery-SampleCode/10_UART-ADC-Blink-LCD/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Microcontroller Division
  * @version V1.0.4
  * @date    Feb-2014
  * @brief   Main program body
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  */
 
/* Includes ------------------------------------------------------------------*/
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "stdarg.h"

#include "stm32l1xx.h"
#include "stdio.h"
#include "discover_board.h"
#include "stm32l_discovery_lcd.h"
#include "stm32l1xx_lcd.h"

/* Private typedef -----------------------------------------------------------*/

extern int GetADC();
extern void ADC_initial();
extern uint8_t t_bar[2];              /* LCD bar graph: used for displaying active function */
uint16_t tab[6];

typedef struct
{
    uint16_t VREF;
    uint16_t TS_CAL_1; // low temperature calibration data
    uint16_t reserved;
    uint16_t TS_CAL_2; // high temperature calibration data
} TSCALIB_TypeDef;

typedef enum 
{
    Display_TemperatureDegC,
    Display_ADCval
} DisplayState_TypeDef;

/* Private define ------------------------------------------------------------*/

#define DEBUG_SWD_PIN  1  /* needs to be set to 1 to enable SWD debug pins, set to 0 for power consumption measurement*/

#define FACTORY_TSCALIB_MD_BASE         ((uint32_t)0x1FF80078)    /*!< Calibration Data Bytes base address for medium density devices*/
#define FACTORY_TSCALIB_MDP_BASE        ((uint32_t)0x1FF800F8)    /*!< Calibration Data Bytes base address for medium density plus devices*/
#define FACTORY_TSCALIB_MD_DATA         ((TSCALIB_TypeDef *) FACTORY_TSCALIB_MD_BASE)
#define FACTORY_TSCALIB_MDP_DATA        ((TSCALIB_TypeDef *) FACTORY_TSCALIB_MDP_BASE)
#define USER_CALIB_BASE           ((uint32_t)0x08080000)    /*!< USER Calibration Data Bytes base address */
#define USER_CALIB_DATA           ((TSCALIB_TypeDef *) USER_CALIB_BASE)
#define TEST_CALIB_DIFF           (int32_t) 50  /* difference of hot-cold calib
                                               data to be considered as valid */ 

#define HOT_CAL_TEMP 		110
#define COLD_CAL_TEMP  	30

#define DEFAULT_HOT_VAL 0x362
#define DEFAULT_COLD_VAL 0x2A8

#define MAX_TEMP_CHNL 16

#define ADC_CONV_BUFF_SIZE 20

#define VDD_CORRECTION 1  /* definition for correction of VDD if <> 3V */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

ADC_InitTypeDef ADC_InitStructure;
ADC_CommonInitTypeDef ADC_CommonInitStructure;
DMA_InitTypeDef DMA_InitStructure;

__IO uint16_t 	ADC_ConvertedValue, T_StartupTimeDelay;

uint32_t ADC_Result, INTemperature, refAVG, tempAVG, vdd_ref, Address = 0;
int32_t temperature_C; 

uint16_t ADC_ConvertedValueBuff[ADC_CONV_BUFF_SIZE];

char strDisp[20] ;

DisplayState_TypeDef CurrentlyDisplayed = Display_TemperatureDegC;

TSCALIB_TypeDef calibdata;    /* field storing temp sensor calibration data */

volatile bool flag_ADCDMA_TransferComplete;
volatile bool flag_UserButton;

static volatile uint32_t TimingDelay;
RCC_ClocksTypeDef RCC_Clocks;

__IO FLASH_Status FLASHStatus = FLASH_COMPLETE; 


/* Private function prototypes -----------------------------------------------*/
void  RCC_Configuration(void);
void  RTC_Configuration(void);
void  Init_GPIOs (void);
void  acquireTemperatureData(void);
void  configureADC_Temp(void);
void  configureDMA(void);
void  powerDownADC_Temper(void);
void  processTempData(void);
void  configureWakeup (void);
void  writeCalibData(TSCALIB_TypeDef *calibStruct);
void getFactoryTSCalibData(TSCALIB_TypeDef *calibdata);
ErrorStatus  testUserCalibData(void);
ErrorStatus  testFactoryCalibData(void);
void insertionSort(uint16_t *numbers, uint32_t array_size);
uint32_t interquartileMean(uint16_t *array, uint32_t numOfSamples);
void clearUserButtonFlag(void);
/*******************************************************************************/
//void UART1_Init();
void UART1_Config(uint32_t BaudRate);
void UART1_Cmd(FunctionalState NewState);
void UART1_Write(char *Buffer, uint32_t Len);



void LED_Config(void)
{
	   GPIO_InitTypeDef g;
	  g.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_15  ;    // ?? 6,7 ?
    g.GPIO_Mode = GPIO_Mode_OUT;           // ???????
    //g.GPIO_PuPd = GPIO_PuPd_UP;            // ??????
    //g.GPIO_PuPd = GPIO_PuPd_DOWN;      // ??????
    g.GPIO_Speed = GPIO_Speed_40MHz;  // ?? GPIO ???40 MHz

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);    // ?? GPIOB

    GPIO_Init(GPIOA, &g);    // ??? GPIO B
	
	  g.GPIO_Pin = GPIO_Pin_2  ;    // ?? 6,7 ?
    g.GPIO_Mode = GPIO_Mode_OUT;           // ???????
    //g.GPIO_PuPd = GPIO_PuPd_UP;            // ??????
    //g.GPIO_PuPd = GPIO_PuPd_DOWN;      // ??????
    g.GPIO_Speed = GPIO_Speed_40MHz;  // ?? GPIO ???40 MHz

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOD, ENABLE);    // ?? GPIOB

    GPIO_Init(GPIOD, &g);    // ??? GPIO B
}

void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
  
  NVIC_InitStructure.NVIC_IRQChannel = TIM6_IRQn ;				 //????2
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;	     //????? 0
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;			 //????2  
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				 //??
  NVIC_Init(&NVIC_InitStructure);

	  NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQn ;				 //????2
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;	     //????? 0
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;			 //????2  
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				 //??
  NVIC_Init(&NVIC_InitStructure);
}
void TIM7_Configuration(int period)
{

	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure; 
	
	TIM_TimeBaseStructure.TIM_Prescaler = 36 - 1;				//??????36000-1,????????72MHz/36000 = 2kHz
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;					//?????? TIM_CKD_DIV1=0x0000,???
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up ; 	//??????????????
	TIM_TimeBaseStructure.TIM_Period = period;		 			//????????,??1000???????????
	
	TIM_TimeBaseInit(TIM7,&TIM_TimeBaseStructure);		  			//??????TIM7?
	
	TIM_UpdateRequestConfig( TIM7, TIM_UpdateSource_Regular);

