powenko/STM32L152C-Discovery-SampleCode/10_UART-ADC-Blink-LCD/src/main.c
	TIM_Cmd(TIM7, ENABLE);											//?????
	TIM_ITConfig(TIM7,TIM_IT_Update,ENABLE);						//????
}



void UART1_Init()
{
 GPIO_InitTypeDef GPIO_InitStructure; 

 /* Pin configuration */
 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  //PB06 , PB07
 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
 GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
 GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
 GPIO_Init(GPIOB, &GPIO_InitStructure);

 /* Alternate function conf */
 GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_USART1 );
 GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_USART1 );

 /* Enable the USART 1 clock */
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
}

void UART1_Config(uint32_t BaudRate)
{
 USART_InitTypeDef USART_InitStructure;

 /* USART conf */
 USART_InitStructure.USART_BaudRate = BaudRate;
 USART_InitStructure.USART_WordLength = USART_WordLength_8b;
 USART_InitStructure.USART_StopBits = USART_StopBits_1;
 USART_InitStructure.USART_Parity = USART_Parity_No;
 USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
 USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
 USART_Init(USART1, &USART_InitStructure);
}

void UART1_Cmd(FunctionalState NewState)
{
 /* Enable/disable the USART */
 USART_Cmd(USART1, NewState);
}

void UART1_Write(char *Buffer, uint32_t Len)
{
 for (; Len > 0; Len--) {

 while (USART_GetFlagStatus(USART1,USART_FLAG_TXE) == RESET)
 ;

 USART_SendData(USART1, *Buffer);
 Buffer++;
 }
 while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
}

// USART_ReceiveData

char buff [100]="";
char buff2 [100]="";
char buff3 [10]="";
int32_t i2;
char* My_Usart1_ReadLine(){    
	  i2=0;
	  while(1){
    if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET){   
        char c = USART_ReceiveData(USART1);   
        i2=i2+1;			
        if(c != '\r' && c != '\n' && i2<9 ){
            sprintf (buff, "%c", c);
        }else{
           // char buff2 [100] = "";
            memcpy(buff2,buff, strlen(buff)); // ? buff ??? buff2
            memset(buff, 0, strlen(buff)); // ?? buff ???????    
			      USART_ClearFlag(USART1, USART_FLAG_RXNE);
            return buff2;
        }
    }
			USART_ClearFlag(USART1, USART_FLAG_RXNE);
	  }
    return "";
}


/**
  * @brief main entry point.
  * @par Parameters None
  * @retval void None
  * @par Required preconditions: None
  */

void DelaySW(uint32_t delay)
{
 uint32_t i=10000;

 for(;delay > 0; delay--){
 for(;i>0;i--)
 ;
 }
}

void RCC_Config(void)
{ 
 RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

 /* Allow access to the RTC */
 PWR_RTCAccessCmd(ENABLE);

 /* Reset Backup Domain */
 RCC_RTCResetCmd(ENABLE);
 RCC_RTCResetCmd(DISABLE);

 /*!< LSE Enable */
 RCC_LSEConfig(RCC_LSE_ON);

 /*!< Wait till LSE is ready */
 while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
 {}
 /*!< LCD Clock Source Selection */
 RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
}

	char* buffer="              ";
	uint8_t i, resp[]={31,32,33,34,35};
	
	
	char* r1="  ";
	
int duty_cycle=1;
int count=0;
int LED[]={1,100,200,400,300,200,100};
int flag[]={0,0,0,0,0,0,0};

void TIM7_IRQHandler(void) 
{ 
	int i;
	int status;
	//????????????
	if(TIM_GetITStatus(TIM7, TIM_IT_Update)== SET)
	{
		//GPIOB->ODR ^= GPIO_Pin_5;
	//	GPIO_WriteBit(GPIOB,GPIO_Pin_7,(BitAction)(1-GPIO_ReadOutputDataBit(GPIOB,GPIO_Pin_7)));
		//	GPIO_WriteBit(GPIOB,GPIO_Pin_7,1);
	//		GPIO_WriteBit(GPIOB,GPIO_Pin_6,0);
			//	TIM_Cmd(TIM7,DISABLE);	
		  count+=1;
	/*	  if(GPIO_ReadOutputDataBit(GPIOB,GPIO_Pin_7))
			{
    		  TIM7_Configuration(2048-duty_cycle) ;
			  	GPIO_WriteBit(GPIOB,GPIO_Pin_7,0);
					GPIO_WriteBit(GPIOB,GPIO_Pin_6,1);
			}else
			{
					TIM7_Configuration(duty_cycle) ;
				  GPIO_WriteBit(GPIOB,GPIO_Pin_7,1);
					GPIO_WriteBit(GPIOB,GPIO_Pin_6,0);
			}
		*/
			for(i=0;i<4;i++)
			{
				if(LED[i]<count)
					 status=1;
				else
					 status=0;
				
					switch(i)
					{
						case 0:
							GPIO_WriteBit(GPIOA,GPIO_Pin_11,status);
						  break;
						case 1:
							GPIO_WriteBit(GPIOA,GPIO_Pin_12,status);
						  break;
						case 2:
							GPIO_WriteBit(GPIOA,GPIO_Pin_15,status);
						  break;
						case 3:
							GPIO_WriteBit(GPIOD,GPIO_Pin_2,status);
						  break;
						case 4:
							GPIO_WriteBit(GPIOC,GPIO_Pin_10,status);
						  break;
						case 5:
							GPIO_WriteBit(GPIOC,GPIO_Pin_11,status);
						  break;
						case 6:
							GPIO_WriteBit(GPIOC,GPIO_Pin_12,status);
						  break;
						}
				
			}
			if(count>320)
			{
				 count=0;
				//GPIO_WriteBit(GPIOB,GPIO_Pin_6,(BitAction)(1-GPIO_ReadOutputDataBit(GPIOB,GPIO_Pin_6)));
			}
			TIM_ClearITPendingBit(TIM7 , TIM_FLAG_Update);
	}
}

void strupr(char *str)
{
	 while(*str!=NULL)
	 {
		  if(*str>='a' && *str<='z')
			{
				*str=*str+('A'-'a');
			}
			str++;
	 }
}



void LCDPrint(char *fmt, ...)
{

    char buffer[80];
    char *a=buffer;
    int cnt;


    va_list argptr;
    va_start(argptr, fmt);
    cnt = vsprintf(buffer,(char *)fmt, argptr);
    va_end(argptr);

   	strupr(buffer);
	
		 strcat(buffer,"\n");
		UART1_Write(buffer, strlen(buffer));
	/*
	BAR0_ON;
  BAR1_ON;
  BAR2_ON;
  BAR3_ON;	
	*/
	for(i=0;i<6;i++)
	   tab[i]=buffer[i];
	
	
  LCD_GLASS_DisplayStrDeci(tab);
}

int main(void)
{
	int i;
	
	
	RCC_Configuration();	                           //?????????????	        
	
	NVIC_Configuration();    
	LED_Config();
	TIM7_Configuration(10) ;
 
  RCC_Config();



 ADC_initial();
 UART1_Init();
 UART1_Config(9600);
 UART1_Cmd(ENABLE);
 UART1_Write("stm start",9);
 LCD_GLASS_Configure_GPIO();
 LCD_GLASS_Init();
      
	

 while (1)
 {
	  int wdt=0;
		int adc_wdt=0;
	  double adc=0;
	 //// solution 2 working String
	   i=0;
	 
